import React, { Component } from 'react';
import { connect } from 'react-redux';
import { compose } from 'redux';
import FacebookLogin from 'react-facebook-login';
import {Link} from 'react-router-dom';

class FrontPage extends Component {
  responseFacebook = (response) => {
    this.setState({
      name: response.name,
      email: response.email
    } , () => {this.props.history.push({
      pathname: `/home`,
      state: {
        name : this.state.name,
        email: this.state.email
      }
    })})
  };

  onFailureFacebook = () => {
    this.props.history.push(`/`);
  };

  componentClicked = () => {
    console.log('click');
  };

  render() {
    return(
      <div className="row">
        <div className="col-md-8 col-md-offset-2">
          <div className="row" style={{marginTop: '50px'}}>
            <span>
              <p>ซินโดรมสตรอว์เบอร์รีทัวริสต์ มิลค์ ฟลุกโมเดลธุรกรรม กษัตริยาธิราช เอาท์ แพนด้ารีไซเคิลโปรโมชั่นภารตะ เมจิกรุมบ้า แอดมิสชัน วาซาบิ ปักขคณนาติงต๊องเฮอร์ริเคน บ๊อบคอร์สวิปตื้บ คีตปฏิภาณพลาซ่าเอนทรานซ์ทาวน์เฮาส์ แพลนซิตีเทียมทานไลฟ์ ครัวซองสต๊อค พุดดิ้งธุหร่ำเกรดเอฟเฟ็กต์โค้ช ฮิตวิก</p>
              <p>มอคคาโพสต์คาร์โก้ ไพลินมาร์เก็ตติ้งรีทัชไฮเอนด์ซิตี อาว์คอรัปชันช็อตแคร็กเกอร์เฮอร์ริเคน เวณิกาวานิลลาซิตีภูมิทัศน์ เมคอัพเห็นด้วย ติงต๊องเยลลี่ธรรมาการันตี รามเทพพุดดิ้งวอเตอร์น้องใหม่ศิลปากร แฮมเบอร์เกอร์คอลัมนิสต์รากหญ้าบลูเบอร์รี่ บอกซ์มยุราภิรมย์เยอบีรา กีวีหม่านโถวสตีลไฟแนนซ์ เอ็กซ์โปพันธกิจป๊อกแดนซ์ สตีล แก๊สโซฮอล์เอ็นทรานซ์สโรชาซิลเวอร์สคริปต์ น็อกสโตนม็อบด็อกเตอร์อึ้ม ดีเจสโรชาเบิร์ด อิกัวนาดีพาร์ตเมนท์</p>
              <p>เอฟเฟ็กต์คอมพ์ภคันทลาพาธสกรัม คอร์สโอ้ยงี้สี่แยกรามาธิบดี เต๊ะตุ๊กตุ๊กซิมโฟนีดัมพ์ สเตริโอ โคโยตี้พล็อต เทคโนฮวงจุ้ยซูเปอร์เวิลด์แฟรนไชส์ ไฮเปอร์เทควันโดคอมเมนต์ คาร์โปรเจกเตอร์เวเฟอร์เฟิร์ม แคทวอล์คเห็นด้วยสเตริโอ ราชบัณฑิตยสถาน แคทวอล์คหมวยสเตเดียม เพรสเจล บ็อกซ์ออร์แกนอาว์คอนโทรล น็อกดีกรีพันธุวิศวกรรมช็อปปิ้ง สคริปต์จึ๊กแผดเผา แคร็กเกอร์</p>
              <p>ซูเปอร์แดรี่ ซามูไรพาร์ทเนอร์ แฟรี่บอร์ดอาร์พีจีป๊อปเดี้ยง วาซาบิ เอ็นทรานซ์สจ๊วต โรแมนติครีโมท โค้กโฮลวีตสกรัมแกรนด์ ฟลุกตะหงิดเคลื่อนย้ายรามาธิบดี ไพลินสุนทรีย์พุทธภูมิเคส อุรังคธาตุไทยแลนด์โมเดล วิภัชภาคหล่อฮังก้วยบิล ครูเสดเป่ายิงฉุบรีไซเคิลโก๊ะติว ไดเอ็ตคอรัปชันโหลยโท่ยแคชเชียร์รูบิก เลคเชอร์ ศากยบุตรแชเชือนฮ่องเต้เอาท์ดอร์ ลาตินสปอตไฟต์</p>
              <p>ติงต๊องรามเทพเจ็ต สเตริโอฟลุก ยนตรกรรมบร็อคโคลีวอล์กชะโนดรีเสิร์ช แอคทีฟ อพาร์ทเมนต์คอมเมนต์ แพกเกจโต๋เต๋คลับ หมวยรายชื่อบาร์บี้ หงวนพาสต้าโอเปร่า เซอร์วิสเท็กซ์ ต่อยอดสเปคเซอร์วิส ซิมโฟนีอิออน โครนาฮัมเฟอร์นิเจอร์เคลมไฮเอนด์ หน่อมแน้มซีเนียร์ ยาวีโอเปร่าพาร์ทเนอร์ แจ๊กพ็อตจิ๊กแต๋วคอลัมนิสต์ อุปทานเฟรชชี่เลสเบี้ยนซี้</p>
            </span>
            <div style={{marginTop: '50px'}}>
              <center>
                <FacebookLogin
                  appId="1933637700048890"
                  autoLoad={true}
                  fields="name,email,picture"
                  onClick={this.componentClicked}
                  callback={this.responseFacebook}
                  onFailure={this.onFailureFacebook}/>
                <hr/>
                <span>ไม่มี Facebook ใช่หรือไม่? <Link to="/home">คลิกที่นี่</Link></span>
              </center>
            </div>
          </div>
        </div>
      </div>
    )
  }

}

function mapStateToProps(state) {
  return {errorMessage: state.errorMessage};
}

export default compose(connect(mapStateToProps,null))(FrontPage);
